//Оператор розгалуження if
// const age = 10;
// if (age < 18) {
//     console.log("Ви не повнолітній!");
// }

//Оператор розгалуження if...else
// if (age > 18) {
//     console.log("Ви можете подорожувати закордон самостійно.");
// } else {
//     console.log("Ви не повнолітній!");
// }

// Оператор розгалуження else...if
// if (age > 18) {
//     console.log("Ви можете подорожувати на космос.");
// } else if (age === 18) {
//     console.log("Ви можете подорожувати на космос.");
// } else {
//     console.log("Ви не можете полетіти на космос(");
// }

// if (age >= 18) {
//     console.log("Ви можете подорожувати на космос.");
// } else {
//     console.log("Ви не можете полетіти на космос(");
// }

// Використовуючи конструкцію if..else, напишіть
//  код, що запитує: ‘Яка “офіційна” назва JavaScript ?’
//  Якщо відвідувач вводить “ECMAScript”,
// виведіть “Правильно!”, в іншому випадку
//  — виведіть: “Ви не знаєте? ECMAScript!”

// const message = prompt("Яка 'офіційна' назва Javascript?");
// console.log(message);
// const checkedWord = "ECMAScript";
// const checkWord = message.toLowerCase() === checkedWord.toLowerCase();
// if (checkWord) {
//     console.log("Так, правильно!");
// } else {
//     console.log("Ви не знаєте? ECMAScript!");
// }

/*
* Напиши скрипт який провіряє можлтвість відкрити чат з користувачем.
* Для цього користувач має бути:
* - другом
* - онлайн
* - без режиму не турбувати
*/
const friend = "Роман";
const online = "Онлайн";
const doNotDisturb = "Не турбувати";
const status = "Друг"

if (friend === status && doNotDistub || online) {
    console.log("Можна відкрити чат!")
}

/* Напиши скрипт перевірки підписки користувача при доступі до контенту
* - Є три типи підписки: free, pro та vip.
* - Отримати доступ можуть лише користувачі pro та vip
*/
const type = 'vip';
if (type === 'free') {
    console.log('You cant enter! >:(')
} else if (type === 'pro' || 'vip') {
    console.log('You can enter:)');
}

const isAccess = type === 'free' ? 'You cant enter! >:(' : 'You can enter:)';
console.log(isAccess);

/*
* Напиши скрипт обробки покупки в магазині.
*
* - Баланс користувача зберігається в змінній balance
* - Сума покупки зберігається в змінній payment
*
* - Перед перевіркою вивести повідомлення:
* «Загальная вартість замовлення [число] кредитів. Перевіряємо кіл-ть доступних грошей на рахунку
*
* - Якщо сума покупки не перевищує баланс:
* - Вирахувати з балансу суму покупки
* - Вивести повідомлення «На рвхунку залишилось [число] кредитів»
* - Якщо сума покупки перевищує баланс:
* - Вивести повідомлення «На рахунку недостатньо грошей для проведення операції!»
* - В кінці вивести повідомлення «Операція завершена»
*/

// let balance = 999;
// const payment = 998;

// const confirmation = confirm(`Загальная вартість замовлення ${payment} кредитів. Перевіряємо кіл-ть доступних грошей на рахунку`);

// if (confirmation === true) {
//     if (balance >= payment) {
//         balance = balance - payment;
//         alert(`На рaхунку залишилось ${balance} кредитів`);
//     } else {
//         alert('На рахунку недостатньо грошей для проведення операції!');
//     };
//     alert('Операція завершена');
// } else {
//     alert('Операція відмінена!');
// }

//Змінна SAVED_PASSWORD зберігає значення попередньо збереженого
// пароля.Попросити в користувача ввести пароль та перевірити чи
/// він правильний.

const savedPassword = 1234;
let userPassword = prompt('Введіть ваш пароль')
userPassword = Number(savedPassword);

// if (userPassword === savedPassword) {
//     alert("Пароль введений правильно! Вітаємо!");
// } else {
//     alert("Пароль введений не правильно! Спробуйте знову!");
// }

userPassword === savedPassword ? alert("Пароль введений правильно! Вітаємо!") : alert("Пароль введений не правильно! Спробуйте знову!");

//Перепишіть конструкцію if, використовуючи умовний оператор "?":

// let result;
// if (a + b < 4) {
//     result = "Нижче";
// } else {
//     result = "Вище";
// }

// const result = a + b < 4 ? "Нижче" : "Вище";

// напишіть код, що отримує число з інпуту
// потім виводить повідомлення на екран:
// 1, якщо значення більше нуля, -1, якщо менше нуля,
// 0, якщо дорівнює нулю

// const promptMessage = prompt("Введіть число");
// const promptResult = promptMessage < 1 ? "-1" : "0";
// promptMessage < 1 ? alert("-1") : alert("0");

// Використовуючи конструкцію if..else, напишіть
//  код, що запитує: ‘Яка “офіційна” назва JavaScript ?’
//  Якщо відвідувач вводить “ECMAScript”,
// виведіть “Правильно!”, в іншому випадку
//  — виведіть: “Ви не знаєте? ECMAScript!”

const message = prompt("Яка 'офіційна' назва Javascript?");
const officialName = "ECMAScript";
const checkName = message.toLowerCase() === officialName.toLowerCase();
const nameType = message === checkName ? "Правильно!" : "Ви не знаєте? ECMAScript!";
console.log(nameType);

// Напиши скрипт обробки покупки в магазині.
// - Баланс користувача зберігається в змінній balance - отримати з інпуту
// Сумма покупки зберігається в змінній рауment отримати з інпуту
// Перед перевіркою вивести повідомлення на екран:
// «Загальна вартість замовлення (число) кредитів. Перевіряємо кількість
// доступних коштів на рахунку»
// Якщо сума покупки не перевищує баланс:
// Відняти з балансу суму покупки
// Вивести повідомлення «На рахунку залишилося (число) кредитів»
// Якщо сума покупки перевищує баланс:
// - Вивести повідомлення «На рахунку недостатньо коштів для проведення
// операції!»
// - В кінці вивести повідомлення «Операція завершена»

// let balance = Number(prompt("Введіть кількість грошей на рахунку"));
// const payment = Number(prompt("Введіть суму покупки"));

// if (balance >= payment) {
//     balance = balance - payment;

//     alert(`На рахунку залишилося ${balance} кредитів`);
// } else {
//     alert("На рахунку недостатньо коштів для проведення операції!");
// }

// alert("Операція завершена");

// const balance = Number(prompt("Введіть кількість грошей на рахунку"));
// const payment = Number(prompt("Введіть суму покупки"));
// const lastBalance = balance - payment;
// const newBalance = balance >= payment ? `На рахунку залишилося ${lastBalance} кредитів` : "На рахунку недостатньо коштів для проведення операції!";

// alert(newBalance);

// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
// - Загальна сума витрачених коштів зберігається в змінній totalSpent
// - Сума поточного платежа зберігається в змінній payment
// - Знижка зберігається в змінній discount

// - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
// - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
// - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
// - Якщо витрачено менше 100) - не партнер, знижка 0%

// - В результаті вивести повідомлення
// «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'

const totalSpent = Number(prompt("Введіть суму витрачених коштів"));
let discount;
let payment;

if (totalSpent >= 100 && totalSpent <= 1000) {
    discount = 0.02;
    payment = totalSpent - (totalSpent * discount);

    alert(
        `Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100}%`
    );
} else if (totalSpent > 1000 && totalSpent <= 5000) {
    discount = 0.05;
    payment = totalSpent - totalSpent * discount;

    alert(
        `Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100}%`
    );
} else if (totalSpent > 5000) {
    discount = 0.1;
    payment = totalSpent - totalSpent * discount;

    alert(
        `Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100}%`
    );
} else {
    payment = totalSpent;

    alert(`Оформляемо замовлення на суму ${payment}`);
}